#include <iostream>
#include <iomanip>
#include "Znak.h"
using namespace std;

//------------------------- «јƒјЌ»≈

/*
—оздать структуру, котора€ будет хранить информации о знаке зодиака, с именем Znak.
—труктура Znak должна содержать следующие пол€ :
 name Ч фамили€, им€ и отчество;
 zodiac Ч знак зодиака;
 bday Ч день рождени€(массив из трЄх чисел).

ѕрограмма, должна уметь выполн€ть следующие действи€ :

- ввод с клавиатуры данных в массив book, который состоит из восьми элементов типа Znak;
- вывод на экран информации о люд€х, родившихс€ в мес€ц, значени€ которого введено с клавиатуры,
если таких нет, выдать на дисплей соответствующее сообщение.
- упор€дочивание записей по знакам «одиака;
*/

//------------------------- Main

int main()
{
	setlocale(LC_ALL, "RU");




	system("pause");
	return 0;
}